app/controllers/restaurants_controller.rb

  def index
    @restaurants = Restaurant.all
---
SELECT "restaurants".* FROM "restaurants"

  def show
    @reviews = Review.where(restaurant_id: @restaurant.id).order("created_at DESC")

    if @reviews.blank?
      @avg_review = 0
    else
      @avg_review = @reviews.average(:rating).round(2)
---
SELECT "reviews".* FROM "reviews"  WHERE "reviews"."restaurant_id" = 1  ORDER BY created_at DESC
SELECT "reviews".* FROM "reviews"  WHERE "reviews"."restaurant_id" = ?  [["restaurant_id", 1]]
SELECT AVG("reviews"."rating") AS avg_id FROM "reviews"  WHERE "reviews"."restaurant_id" = 1

  def create
    @restaurant = current_user.restaurants.build(restaurant_params)

    respond_to do |format|
      if @restaurant.save
---
INSERT INTO "restaurants" ("created_at", "description", "director", "image_content_type", "image_file_name", "image_file_size", "image_updated_at", "rating", "title", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @restaurant.update(restaurant_params)
---
UPDATE "restaurants" SET "image_file_name" = ?, "image_updated_at" = ?, "updated_at" = ? WHERE "restaurants"."id" = 3  [["image_file_name", "alexs.jpeg"], ["image_updated_at", "2017-10-26 14:27:48.474355"], ["updated_at", "2017-10-26 14:27:48.730439"]]

  def destroy
      @restaurant.destroy
---
DELETE FROM "restaurants" WHERE "restaurants"."id" = ?  [["id", 4]]

    def set_restaurant
      @restaurant = Restaurant.find(params[:id])
---
SELECT  "restaurants".* FROM "restaurants"  WHERE "restaurants"."id" = ? LIMIT 1  [["id", 4]]