app/controllers/reviews_controller.rb

INSERT INTO "reviews" ("comment", "created_at", "rating", "restaurant_id", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?)  [["comment", "nice"], ["created_at", "2017-09-07 00:23:37.260890"], ["rating", 5], ["restaurant_id", 1], ["updated_at", "2017-09-07 00:23:37.260890"], ["user_id", 1]]
---
  def create
    @review = Review.new(review_params)
    @review.user_id = current_user.id
    @review.restaurant_id = @restaurant.id

    if @review.save

UPDATE "reviews" SET "comment" = ?, "rating" = ?, "updated_at" = ? WHERE "reviews"."id" = 1  [["comment", "great"], ["rating", nil], ["updated_at", "2017-11-26 22:23:34.378464"]]
---
  def update
    @review.update(review_params)

DELETE FROM "reviews" WHERE "reviews"."id" = ?  [["id", 1]]
---
  def destroy
    @review.destroy

SELECT  "reviews".* FROM "reviews"  WHERE "reviews"."id" = ? LIMIT 1  [["id", 1]]
---
    def set_review
      @review = Review.find(params[:id])

SELECT  "restaurants".* FROM "restaurants"  WHERE "restaurants"."id" = ? LIMIT 1  [["id", 1]]
---
    def set_restaurant
      @restaurant = Restaurant.find(params[:restaurant_id])